In [1]:
import pandas as pd
import numpy as np
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
titanic_data['Fare'].isnull().sum()

0

In [3]:
titanic_data['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [4]:
np.mean(titanic_data['Survived'])

0.3838383838383838

In [5]:
np.median(titanic_data['Fare'])

14.4542

In [6]:
titanic_data[(titanic_data['Sex'] == 'female') & (titanic_data['Survived'] == 1)].shape

(233, 11)

In [7]:
titanic_data[(titanic_data['Sex'] == 'male') & (titanic_data['Survived'] == 1)].shape

(109, 11)

In [8]:
titanic_data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [9]:
x = titanic_data[titanic_data['Survived'] == 1]
x['Pclass'].value_counts()

1    136
3    119
2     87
Name: Pclass, dtype: int64

In [10]:
x[x['Age'] > 18].count()

Survived    220
Pclass      220
Name        220
Sex         220
Age         220
SibSp       220
Parch       220
Ticket      220
Fare        220
Cabin       105
Embarked    218
dtype: int64

In [11]:
survived_passengers = titanic_data[titanic_data['Survived'] == 1]
survived_passengers['Embarked'].value_counts()

S    217
C     93
Q     30
Name: Embarked, dtype: int64

In [12]:
z = titanic_data.copy()
z = z.dropna(axis = 0 ,subset = ['Age'])
np.median(z['Age'])

28.0

In [13]:
titanic_data['Name'].nunique()

891

In [14]:
titanic_data.nlargest(5,['Fare'])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S

In [48]:
house_data = pd.read_csv('https://raw.githubusercontent.com/dphi-official/Datasets/master/kc_house_data/kc_house_data.csv')
house_data.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,221900.0,3,1.00,1180,5650,1.0,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,538000.0,3,2.25,2570,7242,2.0,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,180000.0,2,1.00,770,10000,1.0,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,604000.0,4,3.00,1960,5000,1.0,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,510000.0,3,2.00,1680,8080,1.0,0,0,3,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [49]:
house_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16613 entries, 0 to 16612
Data columns (total 19 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          16613 non-null  float64
 1   bedrooms       16613 non-null  int64
 2   bathrooms      16613 non-null  float64
 3   sqft_living    16613 non-null  int64
 4   sqft_lot       16613 non-null  int64
 5   floors         16613 non-null  float64
 6   waterfront     16613 non-null  int64
 7   view           16613 non-null  int64
 8   condition      16613 non-null  int64
 9   grade          16613 non-null  int64
 10  sqft_above     16613 non-null  int64
 11  sqft_basement  16613 non-null  int64
 12  yr_built       16613 non-null  int64
 13  yr_renovated   16613 non-null  int64
 14  zipcode        16613 non-null  int64
 15  lat            16613 non-null  float64
 16  long           16613 non-null  float64
 17  sqft_living15  16613 non-null  int64
 18  sqft_lot15     16613 non-null  int64
dtypes: float64(5), int64(14)
memory usage: 2.4 MB

In [50]:
X = house_data.drop('price', axis = 1)
y = house_data['price']

In [51]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.3)

In [21]:
from sklearn.linear_model import LinearRegression
model = LinearRegression(normalize = True)
model.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=True)

In [22]:
y_pred = model.predict(X_test)

In [23]:
from sklearn.metrics import r2_score
r2_score(y_test, y_pred)

0.7072742409331336

In [42]:
from sklearn.tree import DecisionTreeRegressor

# Define model. Specify a number for random_state to ensure same results each run
melbourne_model = DecisionTreeRegressor(max_depth=3,random_state = 42)

# Fit model
melbourne_model.fit(X_train, y_train)

DecisionTreeRegressor(ccp_alpha=0.0, criterion='mse', max_depth=3,
                      max_features=None, max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, presort='deprecated',
                      random_state=42, splitter='best')

In [43]:
y_pred = melbourne_model.predict(X_test)

In [47]:
from sklearn.metrics import r2_score
r2_score(y_test, y_pred)

0.7003447207921407

In [45]:
from sklearn.metrics import mean_squared_error
print("Root Mean Squared Error: ",mean_squared_error(y_test, y_pred,squared = False))

Root Mean Squared Error:  198847.22979921327

In [54]:
# Import the model we are using
from sklearn.ensemble import RandomForestRegressor
# Instantiate model with 1000 decision trees
rf = RandomForestRegressor(n_estimators = 1000, random_state = 42)
# Train the model on training data
rf.fit(X_train, y_train);

In [55]:
y_pred = rf.predict(X_test)